---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookOrientTopDirn2
source: html/6b10eca8-1942-1ad7-06ad-551a16f52794.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookOrientTopDirn2 Property

"Top Minor Hook Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemHookOrientTopDirn2 { get; }
```